package war.ai;
//脅威評価パラメータ　プレーヤAI用

public class pAiConfig extends AIConfig{
	//同じAIに受け取ってもらえるように、AIConfigの子クラスにする
	//フィールドは上書きできないので、コンストラクタで書き換える
	public pAiConfig(){
	
	
    // ========================================
    // ゾーン判定 敵からの距離
    // ========================================
    this.THREAT_ZONE_1 = 0.3;      		// 決戦領域
    this.THREAT_ZONE_2 = 0.6;      		// 戦闘領域
//    this.THREAT_ZONE_3 = 0.3;      		// 回復領域 実際は戦闘領域外は回復領域なので、パラメータは未使用
    
    // ========================================
    // AC DC AT DTの閾値パラメータ
    // 命名規則　詳しくは仕様表を参照
    //   　P0*-------Z*------AA------AC---------n------O
    // 仕様表のNo  ゾーン 2回の行動 パラメータ 回数  以上/以下
    // ========================================
    this.P01_Z1_AA_AC_2_O = 0.9;
    this.P02_Z1_AE_DT_2_U = 0.2;
    this.P03_Z1_ER_DT_2_U = 0.6;
    this.P05_Z2_CA_AT_1_O = 1.0;
    this.P06_Z2_AA_DC_2_U = 0.3;
    this.P07_Z2_AE_DT_2_U = 0.3;
    this.P08_Z2_EE_DT_2_O = 0.7;
    this.P10_Z3_CC_DT_2_U = 0.3;
    this.P11_Z3_CA_DT_2_U = 0.3; 
    
    // ========================================
    // 距離順位による脅威係数（DC,DTの計算に使用）
    // ========================================
    this.RANK_1_THREAT = 1.0;             // 1位（最も近い）
    this.RANK_2_THREAT = 0.4;              // 2位
    this.RANK_3_THREAT = 0.2;              // 3,4位
    this.RANK_4_THREAT = 0.1;              // 5位以降
	}    
    
    
}